app/controllers/bhcc_accesses_controller.rb

  def index

    @myParams = params[:code]

    @response = HTTParty.post("https://www.strava.com/oauth/token",
      :query => { :client_id => "177", :client_secret=> "ef771e84b333761f8cdf75b70be82aa396862e5e",:code => params[:code] })

    @result = JSON.parse(@response)

    @bhcc_accesses = BhccAccess.all
---
SELECT "bhcc_accesses".* FROM "bhcc_accesses"

  def show
    @bhcc_access = BhccAccess.find(params[:id])
---
SELECT "bhcc_accesses".* FROM "bhcc_accesses" WHERE "bhcc_accesses"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @bhcc_access = BhccAccess.find(params[:id])
---
SELECT "bhcc_accesses".* FROM "bhcc_accesses" WHERE "bhcc_accesses"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @bhcc_access = BhccAccess.new(params[:bhcc_access])

    respond_to do |format|
      if @bhcc_access.save
---
INSERT INTO "bhcc_accesses" ("created_at", "token", "updated_at", "userid", "username") VALUES (?, ?, ?, ?, ?)